system/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v1812                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

scale   1.0;

vertices
(
	(-10 -15 -10) // 0
	(110 -15 -10) // 1
	(110 15 -10)  // 2
	(-10 15 -10)  // 3
	(-10 -15 30)  // 4
	(110 -15 30)  // 5
	(110 15 30)   // 6
	(-10 15 30)   // 7


);

blocks
(
    hex (0 1 2 3 4 5 6 7) (100 100 100) simpleGrading (1 1 1)
);

edges
(
);

boundary
(
    topY
    {
        type patch;
        faces
        (
            (3 7 6 2) //topY
        );
    }
    bottomY
    {
        type patch;
        faces
        (
            (1 5 4 0) // bottomY
        );
    }
    topX
    {
	type patch;
	faces
	(
	     (2 6 5 1) // topX
	);
    }	

    bottomX
    {
	type patch;
	faces
	(
	     (0 4 7 3) // bottomX
	);
    }

    topZ
    {
        type patch;
        faces
        (
            (4 5 6 7) // top Z
        );
    }

    bottomZ
    {
	type patch;
	faces
	(
	    (0 3 2 1) // bottom Z
	);

    }
);

mergePatchPairs
(
);

// ************************************************************************* //
